#include<iostream>
#include "form_of_menu.h"

using namespace std;

void formOfMainMenu() {
	cout << "-----------------------------" << endl;
	cout << "|       Главное меню        |" << endl;
	cout << "-----------------------------" << endl;
	cout << "| 1 - Режим редактирования  |" << endl;
	cout << "|                           |" << endl;
	cout << "| 2 - Режим обработки       |" << endl;
	cout << "|                           |" << endl;
	cout << "| 0 - Выйти из программы    |" << endl;
	cout << "-----------------------------\n" << endl;
}
void formOfEditMode() {
	cout << "-----------------------------------" << endl;
	cout << "|      Режим редактирования       |" << endl;
	cout << "-----------------------------------" << endl;
	cout << "| 1 - Просмотр всех записей       |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 2 - Добавить студента в список  |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 3 - Удалить студента из списка  |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 4 - Редактировать запись        |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 5 - Загрузить данные из файла   |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 6 - Записать данные в файл      |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 0 - Главное меню                |" << endl;
	cout << "----------------------------------\n" << endl;
}
void formOfEditMenu() {
	cout << "-----------------------------------------" << endl;
	cout << "|          Меню редактирования          |" << endl;
	cout << "-----------------------------------------" << endl;
	cout << "| 1 - Имя                               |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 2 - Номер группы                      |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 3 - Занятие социальными работами      |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 4 - Средний балл                      |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 5 - Доход первого члена семьи         |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 6 - Доход второго члена семьи         |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 0 - Главное меню                      |" << endl;
	cout << "-----------------------------------------\n" << endl;
}
void formOfProcessingMenu() {
	cout << "-------------------------------------" << endl;
	cout << "|          Режим обработки          |" << endl;
	cout << "-------------------------------------" << endl;
	cout << "| 1 - Меню поиска                   |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 2 - Меню сортировки списка        |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 3 - Меню распределения мест       |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 0 - Главное меню                  |" << endl;
	cout << "------------------------------------\n" << endl;
}
void formOfSearchMenu() {
	cout << "-----------------------------------------" << endl;
	cout << "|              Меню поиска              |" << endl;
	cout << "-----------------------------------------" << endl;
	cout << "| 1 - Поиск студентов по имени          |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 2 - Поиск студентов по номеру группы  |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 3 - Поиск студентов по средниму баллу |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 0 - Главное меню                      |" << endl;
	cout << "-----------------------------------------\n" << endl;
}

void formOfSortingMenu() {
	cout << "-----------------------------------------" << endl;
	cout << "|           Меню сортировки             |" << endl;
	cout << "-----------------------------------------" << endl;
	cout << "| 1 - Сортировка по алфавиту            |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 2 - Сортировка по среднему баллу      |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 3 - Сортировка по доходу              |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 0 - Главное меню                      |" << endl;
	cout << "-----------------------------------------\n" << endl;
}

void formOfMenuOfSettelment() {
	cout << "+----------------------------------------------------+" << endl;
	cout << "|           Меню распределения студентов             |" << endl;
	cout << "+----------------------------------------------------+" << endl;
	cout << "| 1 - Вывести список очередности предоставления мест |" << endl;
	cout << "|                                                    |" << endl;
	cout << "| 2 - Ввод минимальной зарплаты                      |" << endl;
	cout << "|                                                    |" << endl;
	cout << "| 0 - Главное меню                                   |" << endl;
	cout << "+----------------------------------------------------+\n" << endl;
}