#include<iostream>
#include "form_of_menu.h"

using namespace std;

void formOfMainMenu() {
	cout << "-----------------------------\n"
	        "|       Главное меню        |\n" 
	        "-----------------------------\n" 
	        "| 1 - Режим редактирования  |\n" 
	        "|                           |\n" 
	        "| 2 - Режим обработки       |\n" 
	        "|                           |\n" 
	        "| 0 - Выйти из программы    |\n" 
	        "-----------------------------\n" << endl;
}
void formOfEditMode() {
	cout << "-----------------------------------\n" \
		    "|      Режим редактирования       |\n" \
		    "-----------------------------------\n" \
		    "| 1 - Меню просмотра              |\n" \
	        "|                                 |\n" \
	        "| 2 - Добавить студента в список  |\n" \
	        "|                                 |\n" \
	        "| 3 - Удалить студента из списка  |\n" \
	        "|                                 |\n" \
	        "| 4 - Редактировать запись        |\n" \
	        "|                                 |\n" \
	        "| 5 - Загрузить данные из файла   |\n" \
	        "|                                 |\n" \
	        "| 6 - Записать данные в файл      |\n" \
	        "|                                 |\n" \
	        "| 0 - Главное меню                |\n" \
	        "-----------------------------------\n" << endl;
}
void formOfEditMenu() {
	cout << "-----------------------------------------\n"\
	        "|          Меню редактирования          |\n"\
	        "-----------------------------------------\n"\
	        "| 1 - Имя                               |\n"\
	        "|                                       |\n"\
	        "| 2 - Номер группы                      |\n"\
	        "|                                       |\n"\
	        "| 3 - Занятие социальными работами      |\n"\
	        "|                                       |\n"\
	        "| 4 - Средний балл                      |\n"\
	        "|                                       |\n"\
	        "| 5 - Доход первого члена семьи         |\n"\
	        "|                                       |\n"\
	        "| 6 - Доход второго члена семьи         |\n"\
	        "|                                       |\n"\
	        "| 0 - Главное меню                      |\n"\
	        "-----------------------------------------\n" << endl;
}
void formOfProcessingMenu() {
	cout << "-------------------------------------\n"\
	        "|          Режим обработки          |\n"\
	        "-------------------------------------\n"\
	        "| 1 - Меню поиска                   |\n"\
	        "|                                   |\n"\
	        "| 2 - Меню сортировки списка        |\n"\
	        "|                                   |\n"\
	        "| 3 - Меню распределения мест       |\n"\
	        "|                                   |\n"\
	        "| 0 - Главное меню                  |\n"\
	        "------------------------------------\n" << endl;
}
void formOfSearchMenu() {
	cout << "-----------------------------------------\n"\
		"|              Меню поиска              |\n"\
		"-----------------------------------------\n"\
		"| 1 - Поиск студентов по имени          |\n"\
		"|                                       |\n"\
		"| 2 - Поиск студентов по номеру группы  |\n"\
		"|                                       |\n"\
		"| 3 - Поиск студентов по средниму баллу |\n"\
		"|                                       |\n"\
		"| 0 - Главное меню                      |\n"\
		"-----------------------------------------\n" << endl;
}

void formOfSortingMenu() {
	cout << "-----------------------------------------\n"\
		    "|           Меню сортировки             |\n"\
		    "-----------------------------------------\n"\
		    "| 1 - Сортировка по алфавиту            |\n"\
		    "|                                       |\n"\
		    "| 2 - Сортировка по среднему баллу      |\n"\
		    "|                                       |\n"\
		    "| 3 - Сортировка по доходу              |\n"\
		    "|                                       |\n"\
		    "| 0 - Главное меню                      |\n"\
		    "-----------------------------------------\n" << endl;
}

void formOfMenuOfSettelment() {
	cout << "+----------------------------------------------------+\n"\
		    "|           Меню распределения студентов             |\n"\
		    "+----------------------------------------------------+\n"\
		    "| 1 - Вывести список очередности предоставления мест |\n"\
		    "|                                                    |\n"\
		    "| 2 - Ввод минимальной зарплаты                      |\n"\
		    "|                                                    |\n"\
		    "| 0 - Главное меню                                   |\n"\
		    "+----------------------------------------------------+\n" << endl;
}

void formOfOutputMenu() {
	cout<< "------------------------------------------------------------\n"\
		"|                       Меню просмотра                     |\n"\
		"------------------------------------------------------------\n"\
		"| 1 - Показать всех студентов                              |\n"\
		"|                                                          |\n"\
		"| 2 - Показать общественников                              |\n"\
		"|                                                          |\n"\
		"| 3 - Показать студентов с доходом меньше 2-х мин. зарплат |\n"\
		"|                                                          |\n"\
		"| 0 - Главное меню                                         |\n"\
		"------------------------------------------------------------\n" << endl;
}