#include<iostream>
#include"menu.h"

using namespace std;

void formOfMainMenu() {
	cout << "-----------------------------" << endl;
	cout << "|       Главное меню        |" << endl;
	cout << "-----------------------------" << endl;
	cout << "| 1 - Режим редактирования  |" << endl;
	cout << "|                           |" << endl;
	cout << "| 2 - Режим обработки       |" << endl;
	cout << "|                           |" << endl;
	cout << "| 0 - Выйти из программы    |" << endl;
	cout << "-----------------------------\n" << endl;
}
void formOfEditMenu() {
	cout << "-----------------------------------" << endl;
	cout << "|       Меню редактирования       |" << endl;
	cout << "-----------------------------------" << endl;
	cout << "| 1 - Добавить студента в список  |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 2 - Удалить студента из списка  |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 3 - Редактировать запись        |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 4 - Загрузить данные из файла   |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 5 - Записать данные в файл      |" << endl;
	cout << "|                                 |" << endl;
	cout << "| 0 - Главное меню                |" << endl;
	cout << "----------------------------------\n" << endl;
}
void formOfProcessingMenu() {
	cout << "-------------------------------------" << endl;
	cout << "|          Меню обработки           |" << endl;
	cout << "-------------------------------------" << endl;
	cout << "| 1 - Меню поиска                   |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 2 - Меню сортировки списка        |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 3 - Меню индивидуального задания  |" << endl;
	cout << "|                                   |" << endl;
	cout << "| 0 - Главное меню                  |" << endl;
	cout << "------------------------------------\n" << endl;
}
void formOfSearchMenu() {
	cout << "-----------------------------------------" << endl;
	cout << "|              Меню поиска              |" << endl;
	cout << "-----------------------------------------" << endl;
	cout << "| 1 - Поиск студентов по имени          |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 2 - Поиск студентов по номеру группы  |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 3 - Поиск студентов по средниму баллу |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 0 - Главное меню                      |" << endl;
	cout << "-----------------------------------------\n" << endl;
}

void formOfSortingMenu() {
	cout << "-----------------------------------------" << endl;
	cout << "|           Меню сортировки             |" << endl;
	cout << "-----------------------------------------" << endl;
	cout << "| 1 - Сортировка по алфиту              |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 2 - Сортировка по среднему баллу      |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 3 - Сортировка по доходу              |" << endl;
	cout << "|                                       |" << endl;
	cout << "| 0 - Главное меню                      |" << endl;
	cout << "-----------------------------------------\n" << endl;
}